{
    "accuracy": [
        "CFD - 1",
        "RUI - 1"
    ],
    "comments": [
        "JKK - These are copied from the old doc and should be checked",
        "CFD - Should we change i.uniqname to i.name='%DeOrio%'? It's one thing to say our system just gets the entity names right magically, but it's another to say that it also figures out the uniqname given the instructor name.",
        "RUI - This is based on the assumption of next semester."
    ],
    "helpfulness": [
        "CFD - 2",
        "RUI - 2"
    ],
    "info": [],
    "paraphrases": [
        "Are there any courses being taught by Dr. DeOrio next semester ?",
        "Beginning next semester ; which classes will be taught by Dr. DeOrio ?",
        "Can I have a list of the classes Dr. DeOrio is teaching next semester ?",
        "Can you provide me with a list of classes being taught by Dr. DeOrio next semester ?",
        "Could you tell me what classes will be taught by Dr. DeOrio next semester ?",
        "Do you have a list of Dr. DeOrio 's classes for next semester ?",
        "Do you know what Dr. DeOrio is teaching next semester ?",
        "Dr. DeOrio is instructing which classes next semester ?",
        "Dr. DeOrio is teaching which classes next semester ?",
        "Dr. DeOrio will be teaching which classes next semester ?",
        "Dr.DeOrio is teaching which classes next semester ?",
        "During next semester , what classes will Dr. DeOrio be teaching ?",
        "For next semester , which classes are taught by Dr. DeOrio ?",
        "For the next semester which classes will Dr. DeOrio teach ?",
        "If I want to take a class with Dr. DeOrio next semester , what are my choices ?",
        "In next semester what classes is Dr. DeOrio teaching ?",
        "In next semester which classes are taught by Dr. DeOrio ?",
        "In next semester which classes is Dr. DeOrio teaching ?",
        "In this next semester what will Dr. DeOrio be teaching ?",
        "Is Dr. DeOrio teaching any classes next semester ?",
        "Is Dr. DeOrio teaching any classes next semester ?",
        "Is Dr. DeOrio teaching classes next semester ?",
        "Is Dr. DeOrio teaching next semester , which courses ?",
        "Name the classes Dr. DeOrio is teaching next semester .",
        "Name the classes Dr. DeOrio teaches next semester .",
        "Next semester Dr. DeOrio is teaching which courses ?",
        "Next semester are there any classes taught by Dr. DeOrio ?",
        "Next semester classes , what is Dr. DeOrio teaching ?",
        "Next semester Dr. DeOrio will teach which classes ?",
        "Next semester is Dr. DeOrio teaching any classes and which if so ?",
        "Next semester what classes will Dr. DeOrio be teaching . ?",
        "Next semester which classes is Dr. DeOrio teaching ?",
        "Next semester which classes will Dr. DeOrio be teaching ?",
        "Next semester , what classes is Dr. DeOrio teaching ?",
        "Next semester , what classes will Dr. DeOrio be teaching ?",
        "Next semester , what classes will Dr. DeOrio teach ?",
        "Next semester , what courses is Dr. DeOrio teaching ?",
        "Next semester , which classes are Dr. DeOrio teaching ?",
        "Next semester , which classes are being taught by Dr. DeOrio ?",
        "Next semester , which classes is Dr. DeOrio teaching ?",
        "Of all of the classes next semester , which ones are Dr. DeOrio teaching ?",
        "Of all the classes next semester , which ones are being taught by Dr. DeOrio ?",
        "Of the classes next semester , which are Dr. DeOrio teaching ?",
        "Over next semester , what classes is Dr. DeOrio teaching ?",
        "Please provide me with a list of classes being taught by Dr. DeOrio next semester .",
        "Please show me the list of Dr. DeOrio 's courses next semester .",
        "Speaking of next semester , what classes is Dr. DeOrio teaching ?",
        "What are the class numbers Dr. DeOrio is doing in the next semester ?",
        "What are the course numbers Dr. DeOrio is teaching next semester ?",
        "What classes are Dr. DeOrio teaching next semester ?",
        "What classes are being taught by Dr. DeOrio next semester ?",
        "What classes is Dr. DeOrio teaching for the next semester ?",
        "What classes is Dr. DeOrio teaching next semester ?",
        "What classes next semester are being taught by Dr. DeOrio ?",
        "What classes next semester is Dr. DeOrio teaching ?",
        "What classes will Dr. DeOrio be teaching next semester ?",
        "What classes will Dr. DeOrio be teaching next semester ?",
        "What classes will Dr. DeOrio be teaching this upcoming semester ?",
        "What courses are being taught by Dr. DeOrio next semester ?",
        "What is Dr. DeOrio is class schedule next semester ?",
        "What is on Dr. DeOrios roster for the next term ?",
        "What will be the classes that are taught by Dr. DeOrio next semester ?",
        "Which are the classes that Dr. DeOrio teaches next semester ?",
        "Which classes are Dr. DeOrio teaching next semester ?",
        "Which classes are being taught by Dr. DeOrio next semester ?",
        "Which classes are taught by Dr. DeOrio next semester ?",
        "Which classes is Dr. DeOrio teaching next semester ?",
        "Which classes will Dr. DeOrio be teaching next semester ?",
        "Which classes will Dr. DeOrio instruct next semester ?",
        "Which classes will be taught by Dr. DeOrio next semester ?",
        "Which courses are Dr. DeOrio teaching next semester ?",
        "Which courses is professor DeOrio teaching next semester ?",
        "Which courses will be taught by Dr. DeOrio next semester ?",
        "Which of Dr. DeOrio 's classes are being offered next semester ?",
        "Which of the classes are being taught by Dr. DeOrio next semester ?",
        "Will Dr. DeOrio be teaching any classes next semester ?",
        "Will all of Dr. DeOrio 's classes be available next semester and if not , which ones will be available ? ?"
    ],
    "sentence": "What classes is Dr. DeOrio teaching next semester ?",
    "sentence-with-vars": "What classes is instructor0 teaching next semester ?",
    "sql": [
        "SELECT COURSEalias0.DEPARTMENT , COURSEalias0.NUMBER , INSTRUCTORalias0.NAME FROM COURSE AS COURSEalias0 , COURSE_OFFERING AS COURSE_OFFERINGalias0 , INSTRUCTOR AS INSTRUCTORalias0 , OFFERING_INSTRUCTOR AS OFFERING_INSTRUCTORalias0 , SEMESTER AS SEMESTERalias0 WHERE COURSEalias0.COURSE_ID = COURSE_OFFERINGalias0.COURSE_ID AND INSTRUCTORalias0.NAME LIKE \"%deorio%\" AND OFFERING_INSTRUCTORalias0.INSTRUCTOR_ID = INSTRUCTORalias0.INSTRUCTOR_ID AND OFFERING_INSTRUCTORalias0.OFFERING_ID = COURSE_OFFERINGalias0.OFFERING_ID AND SEMESTERalias0.SEMESTER = \"FA\" AND SEMESTERalias0.SEMESTER_ID = COURSE_OFFERINGalias0.SEMESTER AND SEMESTERalias0.YEAR = 2016 ;"
    ],
    "sql-with-vars": "SELECT COURSEalias0.DEPARTMENT , COURSEalias0.NUMBER , INSTRUCTORalias0.NAME FROM COURSE AS COURSEalias0 , COURSE_OFFERING AS COURSE_OFFERINGalias0 , INSTRUCTOR AS INSTRUCTORalias0 , OFFERING_INSTRUCTOR AS OFFERING_INSTRUCTORalias0 , SEMESTER AS SEMESTERalias0 WHERE COURSEalias0.COURSE_ID = COURSE_OFFERINGalias0.COURSE_ID AND INSTRUCTORalias0.NAME LIKE \"%instructor0%\" AND OFFERING_INSTRUCTORalias0.INSTRUCTOR_ID = INSTRUCTORalias0.INSTRUCTOR_ID AND OFFERING_INSTRUCTORalias0.OFFERING_ID = COURSE_OFFERINGalias0.OFFERING_ID AND SEMESTERalias0.SEMESTER = \"semester0\" AND SEMESTERalias0.SEMESTER_ID = COURSE_OFFERINGalias0.SEMESTER AND SEMESTERalias0.YEAR = year0 ;",
    "unchecked-paraphrases": [],
    "variables": [
        {
            "name": "instructor0",
            "sentence-value": "Dr. DeOrio",
            "sql-value": "deorio"
        },
        {
            "name": "semester0",
            "sentence-value": "",
            "sql-value": "FA"
        },
        {
            "name": "year0",
            "sentence-value": "",
            "sql-value": "2016"
        }
    ]
}